<template>
    <main class="">
        <sectionHeader :header="header" />
        <div class="clearfix"></div>

        <sectionCompany :company="company" />
        <div class="clearfix"></div>

        <sectionTechnology :technology="technology" />
        <div class="clearfix"></div>

        <sectionCases :cases="cases" />
        <div class="clearfix"></div>

        <sectiontimeline :timeLine="timeLine" />
        <div class="clearfix"></div>
    </main>
</template>

<script>
    import sectionHeader from '@/components/section.header'
    import sectiontimeline from '@/components/section.timeLine'
    import sectionCompany from '@/components/section.company'
    import sectionTechnology from '@/components/section.technology'
    import sectionCases from '@/components/section.cases'

    export default {
        components: {
            sectionHeader,
            sectiontimeline,
            sectionCompany,
            sectionTechnology,
            sectionCases
        },
        data() {
            return {
                header: {
                    h1: 'Q-Bid – команда разработчиков, аналитиков, стратегов и медиабаеров. ',
                    desc: 'Мы реализуем гибкие Adtech-решения на основе ML моделей, которые помогают брендам, агентствам сделать programmatic размещения более эффективными.',
                },
                timeLine: {
                    slides: ['Компания основана в 2019 году', 'В сентябре 2019 разработан Bidder','В декабре 2020 релиз собственной DMP', 'В январе 2020 подключено DCO', 'В мае 2020 - 40 сотрудников, 25 разработчиков', 'В июле 2020 – более 350 клиентов'],
                },
                company: {
                    slides: [
                        {name: 'Независимая собственная DSP (full-service)'},
                        {name: 'Независимая собственная DMP (450 млн кук в месяц, более 100 готовых сегментов)\n'},
                        {name: 'Любые модели закупок (Open Auction, Header Bidding, Direct Deals)'},
                        {name: 'Собственный конструктор динамических креативов'},
                        {name: '90% покрытие рунета (все SSP, в том числе Google, Yandex)'},
                        {name: 'Защита от фрода и 100% видимости рекламных материалов'},
                        {name: 'Real-time контроль показателей (интерфейс)'},
                        {name: 'Здесь бы нарисовать какую-то схему'},
                    ],
                    list: [
                        {
                            head: 'Заголовок',
                            content: 'Прогнозировать совершений действий пользователями (ML предикт)',
                            icon: 'img/we-can-do/sales.svg',
                        },
                        {
                            head: 'Заголовок',
                            content: 'Стоить обучаемые модели на основании данных клиента и данных собственной DMP для удержания текущих клиентов и более эффективного поиска новых клиентов',
                            icon: 'img/we-can-do/model.svg',
                        },
                        {
                            head: 'Заголовок',
                            content: 'Строить LaL для расширения охвата без потери качества',
                            icon: 'img/we-can-do/back-script.svg',
                        },
                        {
                            head: 'Заголовок',
                            content: 'Реализовывать любые сценарии возврата посетителей (ремаркетинг, динамический ремаркетинг)',
                            icon: 'img/we-can-do/recycle.svg',
                        },
                        {
                            head: 'Заголовок',
                            content: 'Организовывать цепочку персонализированного контакта с пользователем от баннера до контента на сайте',
                            icon: 'img/we-can-do/personal-information.svg',
                        },
                        {
                            head: 'Заголовок',
                            content: 'В процессе аукциона закупать трафик, верифицированный международными верификаторами',
                            icon: 'img/we-can-do/authentication.svg',
                        },
                    ],
                    perfomans: [
                        {
                            head: 'Недвижимость',
                            content: '<li>Просмотр карточки/планировки </li>' +
                                '<li>Переход на страницу «Ипотека» и условия </li>' +
                                '<li>Нажатие на кнопку "Заказать звонок</li>' +
                                '<li>Посещение офиса продаж</li>',
                            pic: 'img/per-1.png',
                        },
                        {
                            head: 'Фармацевтика',
                            content: `<li> Переход на сайт интернет-аптеки</li>
                                <li> Переход на страницу «где купить»</li>
                                <li> Визиты продолжительностью 2+ минуты</li>`,
                            pic: 'img/per-2.png',
                        },
                        {
                            head: 'Авто',
                            content: `<li>Использование конфигуратора авто </li>
                                <li>Переход на страницу «диллеры» </li>
                                <li>Запись на тест-драйв </li>
                                <li>Посещение диллера </li>`,
                            pic: 'img/per-3.png',
                        },
                        {
                            head: 'Банки',
                            content: `<li>Использование онлайн-калькулятора</li>
                                <li>Звонок в банк</li>
                                <li>Заполненная анкета</li>
                                <li>Скачивание приложения банка</li>`,
                            pic: 'img/per-4.png',
                        },
                        {
                            head: 'FMCG',
                            content: `<li>Переход на онлайн-ритейл</li>
                                <li>Переход на страницу где купить   </li>
                                <li>Покупка офлайн</li>`,
                            pic: 'img/per-5.png',
                        },
                        {
                            head: 'Fashion',
                            content: `<li>Переход на онлайн-ритейл</li>
                                <li>Переход на страницу где купить</li>
                                <li>Покупка офлайн</li>`,
                            pic: 'img/per-6.png',
                        },
                        {
                            head: 'Horeca',
                            content: `<li>Переход на страницу «где купить/где заказать»</li>
                                <li>Переход на страницу «условия и цены»</li>
                                <li>Звонок в офис продаж</li>`,
                            pic: 'img/per-7.png',
                        },
                        {
                            head: 'Бизнес-услуги',
                            content: `<li>Оформленная заявка на сайте</li>
                                <li>Звонок в офис</li>`,
                            pic: 'img/per-8.png',
                        }
                    ]
                },
                technology: {
                    slides: [
                        {
                            head: 'Безопасность и антифрод',
                            content: `<li>Многоуровневая защита от фрода</li><li>У нас Pre-bid антифрод (обнаружение фрода в реальном времени)</li><li>Собственные black-листы / вайт-листы</li><li>Post-campaing  верификация</li>`,
                        },
                        {
                            head: 'Форматы',
                            content: `<li>Video <br>
                                    In-Stream/Out-Stream</li><li>Display<br>
                                    Баннеры (jpg, png, gif)<br>
                                    HTML5<br>
                                    Full-screen</li><li>Native</li><li>In-App</li>`,
                        },
                        {
                            head: 'DCO',
                            content: `<li> Автоматизация (готовые шаблоны)</li>
                                <li>Персонализация (для конкретного пользователя в реальном времени) <br>
                                Триггеры + Шаблон = Оптимизация CTR, VTR, CR, пост-клик <br>
                                Зачем нужен динамический ремаркетинг?</li>
                                <li>Дополнительные продажи</li>
                                <li>Увеличение выкупаемости корзины</li>
                                <li>Увеличение частоты покупок</li>
                                <li>Расширение потребляемой матрицы товаров</li>`,
                        },
                        {
                            head: 'DMP + CRM',
                                content: `<p>Чем больше мы знаем о пользователе, с которым контактируем, тем выше вероятность акцентировать внимание на УТП, значимом для него.
                                DMP позволяет накапливать данные из разных источников, их синхронизировать и хранить. А данные позволяют сделать рекламные кампании более эффективными.
                                Основные источники данных для DMP Q-Bid</p><p><b>Основные источники данных для DMP Q-Bid</b></p>
                                <li>Собственные данные клиентов (first-party data)</li>
                                <li>Данные о маркетинговых активностях </li>
                                <li>Данные третьих лиц (third-party data) </li>`,
                        },
                        {
                            head: 'Отчетность в реальном времени',
                            content: `<li>Отслеживайте показатели эффективности кампаний в интуитивно понятном интерфейсе, выгружайте подробные отчеты. </li><li>Отчеты можно готовить за любой временной интервал (от минуты до нескольких месяцев)</li><li>В дашборде доступны медийные, пост-клик и аудиторные показатели.</li>`,
                        },
                    ]
                },
                cases: {
                    menu: [
                        {
                            name:'Недвижимость',
                            val: true,
                            text: ` <div>
                                         <h3>Задача</h3>
                                        Недвижимость<br>
                                        Клиент – застройщик премиум класса. <br> Москва
                                        Цели – привлечь целевую аудиторию на сайт
                                        <ul>
                                            <li>BR <50%</li>
                                            <li>СR>0,1%</li>
                                        </ul>
                                    </div>
                                    <div>
                                        <h3>Проблема</h3>
                                        Ни у одной из SSP нет категоризации или заранее заготовленных списков сайтов с тематикой «Недвижимость»
                                    </div>
                                    <div>
                                        <h3>Решение</h3>
                                        Благодаря собранному списку доменов в результате оценки следующих метрик: визиты, отказы, глубина просмотра, время на сайте, конверсии удалось выполнить плановые значения:
                                        <ul>
                                            <li>Удалось вырастить CR c 0,1% до 0,57%</li>
                                            <li>Удалось увеличить время на сайте с 0:33 до 1:01 сек</li>
                                            <li>Удалось снизить BR с 51% до 47%</li>
                                        </ul>
                                    </div>
                                    `
                        },
                        {
                            name:'FMCG ',
                            val: false,
                            text: ` <div>
                                     <h3>Задача</h3>
                                        Блок FMCG <br>
                                        Клиент – туалетная бумага<br>
                                        Цели – обеспечить досмотр ролика до конца
                                    </div>
                                    <div> <h3>Проблема</h3>
                                    Хронометраж ролика – 37 сек</div>
                                    <div><h3>Решение</h3>
                                    Благодаря синхронизации с CRM клиента была построена модель лояльных пользователей, которая была использована для таргетинга (исключая сегмент текущих покупателей бренда).<br>
                                    Также благодаря синхронизации была построена предиктивная самообучаемая модель, которая позволяла в реальном времени для конкретного пользователя предсказывать вероятность досмотра ролика. <br>
                                    <ul><li>Удалось обеспечить VTR на 191% выше планового значения</li></ul></div>
                                    `
                        }
                    ]
                }
            }
        }
    }
</script>

<style lang="scss">

</style>
